//=================================================================================================
//                                                        
//　　　バレットクラスプログラム[Bullet.h]                   
//      Author:王暁晨(AT-13A-281 04)　2018.05.23      
//                                                        
//=================================================================================================

//=================================================================================================
//　　　ヘッダファイル           
//=================================================================================================
#include"Bullet.h"
#include"Player.h"
#include"Renderer.h"
#include"Manager.h"

//=================================================================================================
//		マクロ定義                                        
//=================================================================================================

//=================================================================================================
//　　　グローバル変数                                    
//=================================================================================================
D3DXVECTOR3 CBullet::m_vePosition = D3DXVECTOR3(0.0f,0.0f,0.0f);
D3DXVECTOR3 CBullet::m_veMove = D3DXVECTOR3(0.0f, 0.0f, 0.0f);								//

//=================================================================================================
//　　　構造体定義                                         
//=================================================================================================

//=================================================================================================
//　　　プレーヤーデストラクタ                                        
//=================================================================================================

CBullet::~CBullet()
{
}

bool CBullet::Init(void)
{
	m_pBullet = CSceneModel::Create("Data\\Model\\Ball.x");
	

	
	m_nLife = 100;

	return false;
}

void CBullet::Uninit(void)
{
}

void CBullet::Update(void)
{
	m_nLife -= 1;
	m_vePosition += m_veMove;

	//バレットの座標をモデリングに転送
	m_pBullet->SetPosition(m_vePosition);
}

void CBullet::Draw(void)
{
}

CBullet * CBullet::Create(D3DXVECTOR3 Pos, D3DXVECTOR3 At)
{
	CBullet *Bullet = new CBullet(1);
	Bullet->Init();

	m_vePosition = Pos;
	m_veMove = (Pos - At) * 0.5f;
	
	return Bullet;
}
//
//bool CBullet::BallJudgement(D3DXVECTOR3 vBall1, D3DXVECTOR3 vBall2, float r1, float r2)
//{
//	float x = vBall1.x - vBall2.x;
//	float y = vBall1.y - vBall2.y;
//	float z = vBall1.z - vBall2.z;
//	float l = x * x + y * y + z * z;
//	return l < (r1 + r2) * (r1 + r2);
//}
