//=================================================================================================
//
//　　　グリッド描画クラスプログラム[Grid.h]
//      Author:王暁晨(AT-13A-281 04)　2018.09.10
//
//=================================================================================================
#pragma once

//=================================================================================================
//　　　ヘッダファイル           
//=================================================================================================
#include "Scene.h"

//=================================================================================================
//		マクロ定義                                        
//=================================================================================================
//FVFの宣言
#define FVF_VERTEX_GRID ( D3DFVF_XYZ | D3DFVF_DIFFUSE )     //グリッドの頂点情報

//=================================================================================================
//　　　構造体定義                                         
//=================================================================================================
typedef struct
{
	D3DXVECTOR3 pos;            //XYZW座標
	D3DCOLOR color;             //色情報
}VERTEX_GRID;

class CGrid :public CScene
{
public:
	CGrid(int nPriority) : CScene(nPriority)
	{
		m_veScale = D3DXVECTOR3(1.0f, 1.0f, 1.0f);
		m_veRotation = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
		m_vePosition = D3DXVECTOR3(0.0f, 0.0f, 10.0f);
	};
	~CGrid();
	bool Init(void);										//グリッド描画クラス初期処理
	void Uninit(void);										//グリッド描画ラス終了処理
	void Update(void);										//グリッド描画ラス更新処理
	void Draw(void);										//グリッド描画ラス描画処理
	static CGrid * Create(void);							//グリッド描画のインスタンス生成
private:
	VERTEX_GRID m_v[44];
	float m_fGridX;
	float m_fGridZ;
};

