//=================================================================================================
//                                                        
//　　　入力処理[input.h]                   
//      Author:王暁晨(AT-12B-242 04)　2017.06.05   
//                                                        
//=================================================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//=================================================================================================
//　　　ヘッダファイル           
//=================================================================================================
#include<Windows.h>
#include<dinput.h>

//=================================================================================================
//		マクロ定義
//=================================================================================================
#define DIRECTINPUT_VERSION (0x0800)
#define	NUM_KEY_MAX			(256)	// キーの最大数
#define	LIMIT_COUNT_REPEAT	(20)	// リピートカウントリミッター

//=================================================================================================
//		プロトタイプ宣言
//=================================================================================================
HRESULT InitKeyboard(HINSTANCE hInstance, HWND hWnd);							//入力処理の初期化
void UninitKeyboard(void);														//キーボードの終了処理
void UpdateKeyboard(void);														//キーボードの更新処理
bool GetKeyboardPress(int nKey);												//キーボードのプレス状態を取得
bool GetKeyboardTrigger(int nKey);												//キーボードのトリガー状態を取得
bool GetKeyboardRepeat(int nKey);												//キーボードのリピート状態を取得
bool GetKeyboardRelease(int nKey);												//キーボードのリリ－ス状態を取得

#endif		//_INPUT_H_