//=================================================================================================
//                                                        
//　　　ライトクラスプログラム[Light.h]                  
//      Author:王暁晨(AT-13A-281 04)　2018.04.17      
//                                                        
//=================================================================================================

//=================================================================================================
//　　　ヘッダファイル           
//=================================================================================================
#include"Light.h"
#include"Renderer.h"

//=================================================================================================
//　　　ライトクラスコンストラクタ                                    
//=================================================================================================
CLight::CLight()
{
	ZeroMemory(&m_Light, sizeof(m_Light));
	
	//ライト型
	m_Light.Type = D3DLIGHT_DIRECTIONAL;

	//ライトの方向
	D3DXVECTOR3 vecDir(1.0f, -1.0f, 0.0f);							//ライトベクトル
	D3DXVec3Normalize((D3DXVECTOR3*)&m_Light.Direction, &vecDir);

	//拡散光（光のメイン色）色の設定
	m_Light.Diffuse.r = 1.0f;
	m_Light.Diffuse.g = 1.0f;
	m_Light.Diffuse.b = 1.0f;
	m_Light.Diffuse.a = 1.0f;

	//環境光（影に現れる色）色の設定
	m_Light.Ambient.r = 1.0f;
	m_Light.Ambient.g = 1.0f;
	m_Light.Ambient.b = 1.0f;
	m_Light.Ambient.a = 1.0f;

	//鏡面光（マテリアルが設定されていたら、テカリ部分）
	//マテリアルが設定されていないと効果は表れない
	m_Light.Specular.r = 1.0f;
	m_Light.Specular.g = 1.0f;
	m_Light.Specular.b = 1.0f;
	m_Light.Specular.a = 1.0f;
}

//=================================================================================================
//　　　ライトクラスデストラクタ                                     
//=================================================================================================
CLight::~CLight()
{
}

//=================================================================================================
//　　　ライトクラス更新処理                                    
//=================================================================================================
void CLight::Update(void)
{
	LPDIRECT3DDEVICE9 pDevice = CRenderer::GetD3DDevice();

	pDevice->SetLight(0, &m_Light);
	pDevice->LightEnable(0, TRUE);
	//グローバルアンビエントの設定
	pDevice->SetRenderState(
		D3DRS_AMBIENT,
		D3DXCOLOR(0.3f, 0.3f, 0.3f, 1.0f)
	);
}

//=================================================================================================
//　　　ライト方向設定                               
//=================================================================================================
void CLight::SetDir(D3DXVECTOR3 vecDir)
{
	D3DXVec3Normalize((D3DXVECTOR3*)&m_Light.Direction, &vecDir);
}

//=================================================================================================
//　　　環境光（影に現れる色）色の設定                               
//=================================================================================================
void CLight::SetAmbient(float r, float g, float b, float a)
{
	m_Light.Ambient.r = r;
	m_Light.Ambient.g = g;
	m_Light.Ambient.b = b;
	m_Light.Ambient.a = a;
}

//=================================================================================================
//　　　拡散光（光のメイン色）色の設定                                 
//=================================================================================================
void CLight::SetDiffuse(float r, float g, float b, float a)
{
	m_Light.Diffuse.r = r;
	m_Light.Diffuse.g = g;
	m_Light.Diffuse.b = b;
	m_Light.Diffuse.a = a;
}

//=================================================================================================
//　　　反射光の設定                                    
//=================================================================================================
void CLight::SetSpecular(float r, float g, float b, float a)
{
	m_Light.Specular.r = r;
	m_Light.Specular.g = g;
	m_Light.Specular.b = b;
	m_Light.Specular.a = a;
}
