//=================================================================================================
//                                                        
//　　　ライトクラスプログラム[Light.h]                  
//      Author:王暁晨(AT-13A-281 04)　2018.04.17      
//                                                        
//=================================================================================================
#include "Light.h"
#include "Renderer.h"
//=================================================================================================
//　　　グローバル変数                                    
//=================================================================================================

//=================================================================================================
//　　　ライトクラスコンストラクタ                                    
//=================================================================================================
CLight::CLight()
{
}

//=================================================================================================
//　　　ライトクラスデストラクタ                                     
//=================================================================================================
CLight::~CLight()
{
}

//=================================================================================================
//　　　ライトクラス更新処理                                    
//=================================================================================================
void CLight::Update(void)
{
	LPDIRECT3DDEVICE9 pDevice = CRenderer::GetD3DDevice();
	
	//ライトの設定
	D3DLIGHT9 light;
	ZeroMemory(&light, sizeof(light));
	light.Type = D3DLIGHT_DIRECTIONAL;
	D3DXVECTOR3 vecDir(1.0f, -1.0f, 0.0f);							//ライトベクトル
	D3DXVec3Normalize((D3DXVECTOR3*)&light.Direction, &vecDir);
	light.Diffuse.r = 1.0f;
	light.Diffuse.g = 1.0f;
	light.Diffuse.b = 1.0f;
	light.Diffuse.a = 1.0f;
	//ライトに追加
	light.Ambient.r = 1.0f;
	light.Ambient.g = 1.0f;
	light.Ambient.b = 1.0f;
	light.Ambient.a = 1.0f;

	pDevice->SetLight(0, &light);
	pDevice->LightEnable(0, TRUE);
	//グローバルアンビエントの設定
	pDevice->SetRenderState(
		D3DRS_AMBIENT,
		D3DXCOLOR(0.3f, 0.3f, 0.3f, 1.0f)
	);
}
