//=================================================================================================
//!	@file	Manager.h
//!	@brief	デバイス管理するヘーダファイル
//!	@date	2018.05.19
//!	@note	DirectXデバイスの生成とモードの管理
//!	@author	王暁晨(AT-13A-281 04)
//=================================================================================================
#pragma once

//=================================================================================================
//	インクルードファイル
//=================================================================================================
#include "main.h"
#include "Renderer.h"
#include "Mode.h"

//=================================================================================================
//!	@class	CManager
//!	@brief	CManagerクラス
//=================================================================================================
class CManager
{
public:
	static bool Init( HWND hWnd, BOOL bWindow);						//マネージャークラス初期処理
	static void Uninit(void);										//マネージャークラス終了処理
	static void Update(void);										//マネージャークラス更新処理
	static void Draw(void);											//マネージャークラス描画処理
	static void SetMode(CMode* Mode);								//ゲームモードの設定
	static CMode* GetMode(void) {return m_Mode;};					//ゲームモードの実体を取得
private:
	static CMode* m_Mode;											//ゲームモード管理のアドレス
	static CScene2D* m_Scene2D;										//プラーを使って2Dポリコン
	static bool m_bBlur;											//プラーのスイッチ
};