//=================================================================================================
//                                                        
//　　　マネージャープログラム[Manager.cpp]                   
//      Author:王暁晨(AT-13A-281 04)　2018.05.19            
//                                                        
//=================================================================================================

//=================================================================================================
//　　　ヘッダファイル           
//=================================================================================================
#include "Manager.h"

//=================================================================================================
//　　　実体定義       
//=================================================================================================
CMode *CManager::m_Mode = nullptr;

//=================================================================================================
//　　　マネージャークラス初期処理         
//=================================================================================================
bool CManager::Init( HWND hWnd, BOOL bWindow)
{
	//DirectX初期化クラス初期処理
	CRenderer::Init(hWnd, bWindow);

	SetMode(new CModeTitle());

	return true;
}

//=================================================================================================
//　　　マネージャークラス終了処理         
//=================================================================================================
void CManager::Uninit(void)
{
	//モード管理ポインタの解放
	m_Mode->Uninit();
	delete m_Mode;
	//シーンオブジェクトのリリース
	CScene::ReleaseAll();
	//DirectX初期化クラス終了処理
	CRenderer::Uninit();
}

//=================================================================================================
//　　　マネージャークラス更新処理        
//=================================================================================================
void CManager::Update(void)
{
	//シーンオブジェクトの更新
	CScene::UpdateAll();
	//モードの更新
	m_Mode->Update();
}

//=================================================================================================
//　　　マネージャークラス描画処理         
//=================================================================================================
void CManager::Draw(void)
{
#if defined(DEBUG)
	//ImGuiDirectX描画前の処理
	ImGui::EndFrame();
#endif//defined(DEBUG)

	//DirectX初期化クラス描画開始処理 
	CRenderer::DrawBegin();

	//Direct3Dによる描画の開始
	if (SUCCEEDED(CRenderer::GetD3DDevice()->BeginScene()))
	{
		//モードの描画
		m_Mode->Draw();
		//シーンオブジェクトの描画
		CScene::DrawAll();
		//Presentの終了処理
		CRenderer::GetD3DDevice()->EndScene();

#if defined(DEBUG)
		//ImGui処理
		ImGui::Render();
		ImGui_ImplDX9_RenderDrawData(ImGui::GetDrawData());
#endif//defined(DEBUG)

	}
	//DirectX初期化クラス描画終了処理 
	CRenderer::DrawEnd();
}

//=================================================================================================
//　　　ゲームモードの設定       
//=================================================================================================
void CManager::SetMode(CMode * Mode)
{
	if (m_Mode != NULL)
	{
		m_Mode->Uninit();
		delete m_Mode;
	}
	m_Mode = Mode;
	if (m_Mode != NULL)
	{
		m_Mode->Init();
	}
}
