//=================================================================================================
//                                                        
//　　　マネージャープログラム[Manager.cpp]                   
//      Author:王暁晨(AT-13A-281 04)　2018.05.19            
//                                                        
//=================================================================================================

//=================================================================================================
//　　　ヘッダファイル           
//=================================================================================================
#include "Manager.h"
#include"main.h"

//=================================================================================================
//　　　インスタンス実体化          
//=================================================================================================
CCamera *CManager::m_Camera = NULL;
CLight *CManager::m_Light = NULL;
CScene *CManager::m_Scene[3] = {NULL};

//=================================================================================================
//　　　マネージャークラス初期処理         
//=================================================================================================
bool CManager::Init( HWND hWnd, BOOL bWindow)
{
	//DirectX初期化クラス初期処理
	CRenderer::Init(hWnd, bWindow);
	m_Camera = new CCamera();
	m_Light = new CLight();
	/*m_Scene2D = CScene2D::Create();
	m_Scene3D = CScene3D::Create();
	m_SceneModel = CSceneModel::Create();*/
	m_Scene[0] = CScene2D::Create();
	m_Scene[1] = CScene3D::Create();
	m_Scene[2] = CSceneModel::Create();

	return true;
}

//=================================================================================================
//　　　マネージャークラス終了処理         
//=================================================================================================
void CManager::Uninit(void)
{
	delete m_Camera;
	delete m_Light;
	//シーンオブジェクトの解放
	int nCount = 0;
	for (nCount = 0;nCount < 3;nCount++)
	{
		m_Scene[nCount]->Uninit();

	}

	//DirectX初期化クラス終了処理
	CRenderer::Uninit();
}

//=================================================================================================
//　　　マネージャークラス更新処理        
//=================================================================================================
void CManager::Update(void)
{
	//シーンオブジェクトの更新
	int nCount = 0;
	for (nCount = 0;nCount < 3;nCount++)
	{
		m_Scene[nCount]->Update();
	}
}

//=================================================================================================
//　　　マネージャークラス描画処理         
//=================================================================================================
void CManager::Draw(void)
{
	//DirectX初期化クラス描画開始処理 
	CRenderer::DrawBegin();

	//Direct3Dによる描画の開始
	if (SUCCEEDED(CRenderer::GetD3DDevice()->BeginScene()))
	{
		m_Camera->Update();
		m_Light->Update();
		//シーンオブジェクトの描画
		int nCount = 0;
		for (nCount = 0;nCount < 3;nCount++)
		{
			m_Scene[nCount]->Draw();
		}
		//Presentの終了処理
		CRenderer::GetD3DDevice()->EndScene();
	}
	//DirectX初期化クラス描画終了処理 
	CRenderer::DrawEnd();
}
