//=================================================================================================
//                                                        
//　　　プレーヤークラスプログラム[Player.cpp]                   
//      Author:王暁晨(AT-13A-281 04)　2018.05.23      
//                                                        
//=================================================================================================

//=================================================================================================
//　　　ヘッダファイル           
//=================================================================================================
#include"Player.h"
#include"main.h"
#include<d3d9.h>
#include<d3dx9.h>
#include"Renderer.h"
#include"input.h"

//=================================================================================================
//		マクロ定義                                        
//=================================================================================================

//=================================================================================================
//　　　グローバル変数                                    
//=================================================================================================

//=================================================================================================
//　　　構造体定義                                         
//=================================================================================================

CPlayer::~CPlayer()
{
}

bool CPlayer::Init(void)
{
	m_pPlayer = CSceneModel::Create();
	m_pPlayer->SetPosition(m_vePosition);
	return true;
}

void CPlayer::Uninit(void)
{
}

void CPlayer::Update(void)
{
	if (GetKeyboardPress(DIK_LEFT))
	{
		m_vePosition += v3Left;
	}
	if (GetKeyboardPress(DIK_RIGHT))
	{
		m_vePosition += v3Right;
	}
	m_pPlayer->SetPosition(m_vePosition);

}

void CPlayer::Draw(void)
{
}

CPlayer * CPlayer::Create(D3DXVECTOR3 vePosition)
{
	CPlayer *Player = new CPlayer(1);
	Player->m_vePosition = vePosition;
	Player->Init();
	return Player;
}
