//=================================================================================================
//                                                        
//　　　DirectX初期化クラスプログラム[Scene.h]
//      Author:王暁晨(AT-13A-281 04)　2018.04.25      
//                                                        
//=================================================================================================
#ifndef _RENDERER_H_                                                 //2重インクルード防止のマクロ定義
#define _RENDERER_H_
#include"main.h"
//=================================================================================================
//　　　マクロ定義                                        
//=================================================================================================

//=================================================================================================
//　　　DirectX初期化クラス                                      
//=================================================================================================
class CRenderer
{
public:
	CRenderer();											//DirectX初期化クラスコンストラクタ
	~CRenderer();											//DirectX初期化クラスデストラクタ
	bool Init(HWND hWnd, BOOL bWindow);						//DirectX初期化クラス初期処理
	void Uninit(void);										//DirectX初期化クラス終了処理
	void Update(void);										//DirectX初期化クラス更新処理
	void Draw(void);										//DirectX初期化クラス描画処理

protected:
	
};

#endif