//=================================================================================================
//                                                        
//　　　3Dモデルクラスプログラム[SceneModel.h]                   
//      Author:王暁晨(AT-13A-281 04)　2018.04.17      
//                                                        
//=================================================================================================
#ifndef _SCENEMODEL_H_                                                 //2重インクルード防止のマクロ定義
#define _SCENEMODEL_H_
#include "Scene.h"
//=================================================================================================
//　　　マクロ定義                                        
//=================================================================================================

//=================================================================================================
//　　　3Dポリゴンクラス                                       
//=================================================================================================
class CSceneModel : public CScene
{
public:
	CSceneModel();											//3Dモデルクラスコンストラクタ
	~CSceneModel();											//3Dモデルクラスデストラクタ
	bool Init(void);										//3Dモデルクラス初期処理
	void Uninit(void);										//3Dモデルクラス終了処理
	void Update(void);										//3Dモデルクラス更新処理
	void Draw(void);										//3Dモデルクラス描画処理

private:
	LPD3DXMESH m_pMesh;										//メッシュを受け取る変数
	DWORD  m_nMaterialNum;									//Xモデルのマテリアル数
	LPD3DXBUFFER m_pMaterial;								//Xモデルのマテリアル情報
	int m_nMaterialPointNum;								//マテリアルポインタの番号
	D3DXVECTOR3 m_XmodelAt;									//Xモデルの注視点
};

#endif