//=================================================================================================
//                                                        
//　　　オブジェクト処理プログラム[Scene.h]                   
//      Author:王暁晨(AT-13A-281 04)　2018.04.17      
//                                                        
//=================================================================================================
#ifndef _SCENE_H_                                                 //2重インクルード防止のマクロ定義
#define _SCENE_H_
#include"main.h"
//=================================================================================================
//　　　マクロ定義                                        
//=================================================================================================

//=================================================================================================
//　　　2Dポリゴンクラス                                       
//=================================================================================================
class CScene
{
public:
	virtual void Init(void) { };						//オブジェクト初期処理
	virtual void Uninit(void) = 0;						//オブジェクト終了処理
	virtual void Update(void) = 0;						//オブジェクト更新処理
	virtual void Draw(void) = 0;						//オブジェクト描画処理

protected:
	D3DXVECTOR3 m_vePosition;							//オブジェクトの位置
	LPDIRECT3DTEXTURE9 m_pTexture;						//テクスチャ管理するメモ帳
};

#endif