//=================================================================================================
//                                                        
//　　　3Dキューブクラスプログラム[Scene3D.h]                   
//      Author:王暁晨(AT-13A-281 04)　2018.04.17      
//                                                        
//=================================================================================================
#ifndef _SCENE3D_H_                                                 //2重インクルード防止のマクロ定義
#define _SCENE3D_H_
#include"main.h"
#include "Scene.h"
//=================================================================================================
//　　　マクロ定義                                        
//=================================================================================================

//=================================================================================================
//　　　3Dポリゴンクラス                                       
//=================================================================================================
class CScene3D : public CScene
{
public:
	CScene3D();												//3Dキューブクラスコンストラクタ
	~CScene3D();											//3Dキューブクラスデストラクタ
	bool Init(void);										//3Dキューブクラス初期処理
	void Uninit(void);										//3Dキューブクラス終了処理
	void Update(void);										//3Dキューブクラス更新処理
	void Draw(void);										//3Dキューブクラス描画処理

private:
	LPDIRECT3DVERTEXBUFFER9 m_pVertexBuffer;				//頂点バッファ管理するメモ帳
	LPDIRECT3DINDEXBUFFER9 m_pIndexBuffer;					//インデックスバッファ管理するメモ
	D3DXMATRIX m_mtxWorld;									//ワールド行列変数
	D3DXMATRIX m_mtxWorldR;									//ワールド キューブの回転行列
	D3DXMATRIX m_mtxWorldRX;								//ワールド キューブのX方向回転行列
	D3DXMATRIX m_mtxWorldRY;								//ワールド キューブのY方向回転行列
	D3DXMATRIX m_mtxWorldRZ;								//ワールド キューブのZ方向回転行列
	D3DXMATRIX m_mtxWorldT;									//ワールド キューブの平行移動行列
	D3DXMATRIX m_mtxWorldS;									//ワールド キューブの平行移動行列
	float m_fRotX;											//3DキューブのX回転
	float m_fRotY;											//3DキューブのY回転
	float m_fRotZ;											//3DキューブのZ回転
};

#endif
