//=================================================================================================
//                                                        
//　　　2Dポリゴンプログラム[Scene2D.h]                   
//      Author:王暁晨(AT-13A-281 04)　2018.04.17      
//                                                        
//=================================================================================================
#ifndef _SCENE2D_H_                                                 //2重インクルード防止のマクロ定義
#define _SCENE2D_H_
#include"main.h"
//=================================================================================================
//　　　マクロ定義                                        
//=================================================================================================

//=================================================================================================
//　　　2Dポリゴンクラス                                       
//=================================================================================================
class CScene2D
{
public:
	CScene2D();										//2Dポリゴンコンストラクタ
	~CScene2D();									//2Dポリゴンデストラクタ
	bool Init(void);								//2Dポリゴン初期処理
	void Uninit(void);								//2Dポリゴン終了処理
	void Update(void);								//2Dポリゴン更新処理
	void Draw(void);								//2Dポリゴン描画処理

private:
	D3DXVECTOR3 m_Position;					
	LPDIRECT3DTEXTURE9 m_Texture;					//頂点バッファ管理するメモ帳
};

#endif